FULL_NAME_REGEXP = "^[а-яёА-ЯЁ]{3,20}? [а-яёА-ЯЁ]{3,20}?$"

DATA_PROCESSING_CONSENT_MESSAGE = ("👋 Привет!\nДобро пожаловать в нашего бота! "
                             "\nДля того чтобы продолжить пользоваться ботом, нам необходимо получить"
                             " ваше согласие на обработку персональных данных. " 
                             "\nВаши данные будут использоваться для:"
                             "\n✨ Регистрации на мероприятия \n📬 Отправки рассылок"
                             "\n📅 Информирования о мероприятиях, соответствующих вашим интересам"
                            "\nНажмите \"Подтвердить\", если вы согласны на обработку ваших персональных данных, "
                             "или \"Отменить\", если вы не хотите продолжать")

DISAGREE_DATA_PROCESSING_CONSENT_MESS = ("❌ К сожалению, вы не согласились на обработку персональных данных."
                                     "Без этого согласия мы не можем предоставить вам доступ к функционалу бота." 
                                     "Если у вас есть вопросы или вы хотите узнать больше о том, "
                                     "как мы используем ваши данные, пожалуйста, напишите в тех.поддержку!"
                                     "Если вы передумаете, просто напишите команду /start, чтобы начать заново.")


HELP_TEXT = (
    "📅 *Мероприятия:*\n\n"
    "• Нажмите *\"🎉Мероприятия\"*, чтобы увидеть список доступных событий.\n"
    "• Выберите интересующее мероприятие и нажмите *\"📝Записаться\"*, чтобы зарегистрироваться.\n"
    "• Подтвердите запись и получите QR-код для входа.\n"
    "• Для отмены записи нажмите *\"❌Я не приду\"*.\n\n"
    
    "📩 *Уведомления:*\n\n"
    "• Бот пришлёт уведомление за неделю и за день до мероприятия, на которое вы записаны.\n"
    "• Каждую неделю бот будет рекомендовать мероприятия на основе ваших посещений.\n\n"
    
    "📊 *Рекомендации мероприятий:*\n\n"
    "• Бот анализирует посещённые вами мероприятия и предлагает похожие события каждую неделю.\n"
    "• Чем больше посещений, тем точнее рекомендации.\n\n"
    
    "📞 *Контакты и поддержка:*\n\n"
    "• Нажмите *\"👤Наши контакты\"*, чтобы увидеть контактную информацию.\n"
    "• Для связи с поддержкой выберите *\"💻Тех поддержка\"*."
)